//
//  Actor.hpp
//  Experiment
//
//  Created by Ryoutarou Onimura on 2016/06/13.
//
//

#ifndef Actor_hpp
#define Actor_hpp

#include <stdio.h>

//=========================================================================
// 追加のインクルードはここから
//=========================================================================
#include "Object.hpp"

//=========================================================================
//
// CActor
//
//=========================================================================
class CActor : public CObject {
    //=========================================================================
    // メンバ変数
    //=========================================================================
protected :
    CBody* m_attackBody {NULL} ;
    // CStatus* m_status {NULL} ;
    
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
public :
    CActor() ;
    virtual ~CActor() ;
    
    //=========================================================================
    // init
    //=========================================================================
public :
    virtual bool init() override ;
    
    //=========================================================================
    // set
    //=========================================================================
public :
    void setAttackBody(const CBody& attackBody) ;
    
    //=========================================================================
    // get
    //=========================================================================
public :
    CBody* getAttackBody() ;
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
public :
    /**
     *  @desc   updata
     */
    virtual void update(float deltaTime) override ;
    
    virtual void moveFunc() override ;
    virtual void animeationFunc() override ;
    virtual void collisionFunc() override ;
    virtual void applyFunc() override ;
    virtual void hitFunc() override ;
    
    virtual void attackFunc() ;
};

#endif /* Actor_hpp */
