//
//  GameMainLayer.hpp
//  Shirodora
//
//  Created by Ryoutarou Onimura on 2016/07/03.
//
//

#ifndef GameMainLayer_hpp
#define GameMainLayer_hpp

#include <stdio.h>

//=========================================================================
// 追加のインクルードはここから
//=========================================================================

//=========================================================================
//
// GameMainLayer
// !!!:キーボードイベントをcocos機能でやるか、インプットマネージャー使うか
// !!!:マウスイベントをcocos機能でやるか、マウスマネージャー使うか
//
//=========================================================================
class CGameMainLayer : public cocos2d::Layer {
    //=========================================================================
    // コンストラクタ/デストラクタ
    //=========================================================================
public :
    /**
     *  @desc   constructor
     */
    CGameMainLayer() ;
    
    /**
     *  @desc   destructor
     */
    virtual ~CGameMainLayer() ;
    
    //=========================================================================
    // メンバ変数
    //=========================================================================
private :
    // TODO:マウススプライトクラスを別で作ってそいつ自身に持たせた方がいいかも
    // マウスカーソル座標
    //cocos2d::Vec2 m_cursorPosition ;
    
    // !!!:テスト用マウスカーソルスプライト
    cocos2d::Sprite *m_pCursor {NULL} ;
    
    
    // TODO:多分画面スクロール時にいる気がする
    // カメラ座標
    cocos2d::Vec2 m_cameraPosition ;
    
    // オブジェクト群
    // std::vector<CObject*> *m_pObjects {NULL} ;
    
    //=========================================================================
    // init
    //=========================================================================
public :
    /**
     *  @desc   init
     */
    virtual bool init() override ;
    
    //=========================================================================
    // set
    //=========================================================================
public :
    
    //=========================================================================
    // get
    //=========================================================================
public :
    
    //=========================================================================
    // メンバ関数
    //=========================================================================
public :
    /**
     *  @desc   update
     *  @param  微小時間
     */
    virtual void update(float deltaTime) override ;
    
    /**
     *  @desc   マウスクリック時の処理
     *  @param  マウスイベント
     */
    void mouseClicked(cocos2d::EventMouse *pEvent) ;
    
    /**
     *  @desc   マウスドロップ時の処理
     *  @param  マウスイベント
     */
    void mouseDroped(cocos2d::EventMouse *pEvent) ;
    
    /**
     *  @desc   マウス移動時の処理
     *  @param  マウスイベント
     */
    void mouseMoved(cocos2d::EventMouse *pEvent) ;
    
    /**
     *  @desc   マウススクロール時の処理
     *  @param  マウスイベント
     */
    void mouseScrolled(cocos2d::EventMouse *pEvent) ;
    
    /**
     *  @desc   カーソルスプライト移動処理
     *  @param  マウスイベント
     */
    void moveCursor(cocos2d::EventMouse *pEvent) ;
    
    
};

#endif /* GameMainLayer_hpp */
